Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: The packfile is a single file containing the contents of all the objects that were removed from your filesystem.
cs: Balíčkový soubor je jediný soubor, v němž je zabalen obsah všech objektů odstraněných ze systému souborů.

source: The previous example uses the `https://` protocol, but you may also see `git://` or `user@server:path/to/repo.git`, which uses the SSH transfer protocol.
cs: Předchozí příklad využívá protokol `https://`, můžete se ale setkat také s protokolem `git://` nebo `user@server:/path/to/repo.git`, který používá přenosový protokol SSH.

source: The problem is, you don’t want to do a commit of half-done work just so you can get back to this point later.
cs: Problém je, že nebudete chtít zapsat revizi nehotové práce, budete se k ní chtít vrátit později.

source: The process works as follows (see <<wfdiag_b>>):
cs: Proces funguje následovně (viz obrázek <<wfdiag_b>>):

source: The process works like this (see <<wfdiag_c>>):
cs: Proces funguje nějak takto (viz obrázek <<wfdiag_c>>):

source: The project maintainer pushes to their public repository.
cs: Správce projektu odešle data do svého veřejného repozitáře.

source: The project snapshot at the tip of the branch is identical whether you do one commit or five, as long as all the changes are added at some point, so try to make things easier on your fellow developers when they have to review your changes.
cs: Snímek projektu na vrcholu větve bude stejný, ať zapíšete jednu revizi, nebo pět (za předpokladu, že vložíte všechny změny). Snažte se proto usnadnit práci svým kolegům, kteří možná někdy budou vaše změny revidovat.

source: The pros of file-based repositories are that they're simple and they use existing file permissions and network access.
cs: Výhoda souborových repozitářů spočívá v tom, že jsou jednoduché a používají existující oprávnění k souborům a pro přístup k síti.

source: The pros of using SSH are many.
cs: Používání protokolu SSH přináší mnoho výhod.

source: The public keys look something like this:
cs: Veřejné klíče mají zhruba tuto podobu:

source: The question now is, when you run `git branch (branchname)`, how does Git know the SHA-1 of the last commit?
cs: Nyní se však nabízí otázka, jak může Git při spuštění příkazu `git branch (název větve)` znát hodnotu SHA-1 poslední revize.

source: The really nice thing about this is that it can be repacked at any time.
cs: Na celém balíčku je navíc příjemné, že ho můžete kdykoli znovu zabalit do nové podoby.

source: The reason is that if the work isn't accepted or is cherry picked, you don't have to rewind your master branch.
cs: Důvod je ten, že pokud nebude vaše práce přijata, nebo pokud z ní budou převzaty jen některé revize, nebudete muset svou větev `master` vracet zpět.

source: The result tells you the changes you've made that you haven't yet staged.
cs: Výsledek vám řekne, jaké změny jste provedli a dosud nepřipravili k zapsání.

source: The rules for the patterns you can put in the `.gitignore` file are as follows:
cs: Pravidla pro masky, které můžete použít v souboru `.gitignore`, jsou následující:

source: The same commit-message editor fires up, but it already contains the message of your previous commit.
cs: Spustí se stejný editor pro editaci zpráv k revizím, ale tentokrát už obsahuje zprávu z vaší předchozí revize.

source: The script puts helpful instructions in the rebase message:
cs: Skript vám ve zprávě k přeskládání podává užitečné instrukce:

source: The second clones an existing Git repository from another server.
cs: Druhý způsob spočívá v naklonování již existujícího gitového repozitáře z jiného serveru.

source: The second command is `git svn show-ignore`, which prints to stdout the lines you need to put in a `.gitignore` file so you can redirect the output into your project exclude file:
cs: Druhým z příkazů je `git svn show-ignore`, který zobrazí standardní výstup stdout s řádky, které budete muset vložit do souboru `.gitignore`. Výstup pak můžete přesměrovat do souboru exclude svého projektu:

source: The second developer must merge in the first one's work before pushing changes up, so as not to overwrite the first developer's changes.
cs: Druhý vývojář musí před odesláním svých změn začlenit (merge) práci prvního vývojáře do své, aby nepřepsal jeho změny.

source: The second developer, Jessica, does the same thing – clones the repository and commits a change:
cs: Druhá vývojářka, Jessica, učiní totéž -- naklonuje repozitář a zapíše provedenou změnu:

source: The second edition of this book is meant to address those changes and update the book so it can be more helpful to the new user.
cs: Druhé vydání knihy se těmto změnám věnuje a snaží se o to, aby byl pro nového uživatele obsah knihy užitečnější.

source: The second line tells Git to ignore all files that end with a tilde (`~`), which is used by many text editors such as Emacs to mark temporary files.
cs: Druhý řádek Gitu říká, aby ignoroval všechny soubory končící vlnovkou (`~`), kterou mnoho textových editorů (např. Emacs) používá k označení dočasných souborů.

source: The sequence for the workflow you saw here is something like this:
cs: Posloupnost událostí ve zde popsaném pracovním postupu vypadá takto:

source: The sequence looks basically like this:
cs: Posloupnost příkazů vypadá v podstatě takto:

source: The simple case is the example you just saw, running `git checkout -b [branch] [remotename]/[branch]`.
cs: Jednoduchým případem je příklad, který jste právě viděli -- spuštění příkazu `git checkout -b [větev] [vzdálený]/[větev]`.

source: The simplest is just to keep it in memory for a few minutes, which you can easily set up by running `git config --global credential.helper cache`.
cs: Nejjednodušší je podržet tyto informace pár minut v paměti, čehož snadno dosáhnete spuštěním `git config --global credential.helper cache`.

source: The stable branches are farther down the line in your commit history, and the bleeding-edge branches are farther up the history.
cs: Stabilní větve leží v linii historie revizí níže a větve s nejčerstvějšími novinkami se nacházejí nad nimi.

source: The staging area is a file, generally contained in your Git directory, that stores information about what will go into your next commit.
cs: Oblast připravených změn je soubor, většinou uložený v adresáři Git, který obsahuje informace o tom, co bude obsahovat příští objekt revize (commit{empty}footnote:[Pozn. překl.: V angličtině se slovo _commit_ používá i jako podstatné jméno s významem výsledku posledního zápisu do databáze Gitu příkazem `commit`. V grafických nástrojích bývá zobrazován jako bod (tečka, kulička, hvězdička). Pojem _revize_ má význam spíš abstraktnější, ale též vyjadřující stav projektu (bez důrazu na způsob uložení nebo znázornění). Pojem _revize_ má v souvislosti se systémy správy verzí své historické kořeny -- viz zmíněný systém RCS (Revision Control System). Je to pravděpodobně rozumný jednoslovný český pojem, kterým se dá nahradit jednoslovné vyjádření _commit_. V situacích vyžadujících přesnější představu budu používat raději dvouslovný „objekt revize“]).

source: The status of the simplegit.rb file is interesting.
cs: Zajímavý je stav souboru simplegit.rb.

source: The useful `--merged` and `--no-merged` options can filter this list to branches that you have or have not yet merged into the branch you're currently on.
cs: Užitečné volby `--merged` a `--no-merged` vám z tohoto seznamu umožní vyfiltrovat větve, které jste do aktuální větve buď začlenili, nebo dosud nezačlenili.

source: The way Git branches is incredibly lightweight, making branching operations nearly instantaneous, and switching back and forth between branches generally just as fast.
cs: Způsob, jakým Git větvení provádí, je neuvěřitelně snadný a operace větvení probíhají téměř okamžitě. A stejně rychlé je většinou i přepínání mezi větvemi.

source: The whole method looks like this:
cs: Celá metoda vypadá takto:

source: The workflow required in order to contribute to a project is much different if you have write access to the project than if you don't.
cs: Pracovní postup při přispívání do projektu se velmi liší podle toho, zda máte, či nemáte oprávnění k zápisu do projektu.

source: The working directory is a single checkout of one version of the project.
cs: Pracovní adresář obsahuje lokální kopii jedné verze projektu.

source: Their GUI Git tool has an option to install command line tools as well.
cs: U nástroje GUI Git je možné zvolit, zda se mají instalovat i nástroje pro příkazový řádek.

source: Then Jessica tries to push her changes, but the server rejects them.
cs: Poté se Jessica pokusí odeslat své změny, ale server je odmítne.

source: Then you can add the submodule:
cs: Proto ho musíte nejprve vrátit, až potom můžete přidat submodul:

source: Then you need to push your work up to it.
cs: Do něj teď musíte odeslat (push) svou práci.

source: Then, John, Josie, or Jessica can push the first version of their project into that repository by adding it as a remote and pushing up a branch.
cs: John, Josie a Jessica pak mohou do tohoto repozitáře odeslat první verzi svého projektu: přidají si ho jako vzdálený repozitář a odešlou do něj svou větev.

source: Then, compile and install:
cs: Poté spusťte kompilaci a instalaci:

source: Then, if you run `git rm`, it stages the file's removal:
cs: Pokud ale provedete `git rm`, odstranění souboru bude připraveno k zapsání:

source: Then, it adds a space followed by the size of the content and finally a null byte:
cs: Poté vloží mezeru, za níž bude následovat velikost obsahu a na konec nulový byte:

source: Then, open the file with `File.open()` and write out the previously zlib-compressed content to the file with a `write()` call on the resulting file handle:
cs: Poté zadejte `File.open()` pro otevření souboru a voláním `write()` na vzniklý identifikátor souboru zapište do souboru právě zkomprimovaný (zlib) obsah:

source: Then, run
cs: Poté spusťte příkaz:

source: Then, she can see what has been changed with `git log`:
cs: Poté si může příkazem `git log` prohlédnout, co všechno bylo změněno:

source: Then, when the codebase on that branch is stable and passes tests, you merge it into a develop branch; and when that has proven itself stable for a while, you fast-forward your master branch.
cs: Teprve pokud je kód v této větvi stabilní a projde testováním, začleníte ho do větve develop. A až se větev develop ukáže v některém okamžiku jako stabilní, posunete rychle vpřed i svou hlavní větev.

source: Then, write some new content to the file, and save it again:
cs: Poté do souboru zapište nový obsah a znovu ho uložte:

source: Then, you branched off that to make the client-side changes (`client`) and committed a few times.
cs: Poté jste se odvětvili, abyste učinili změny na straně klienta (`client`), a provedli jste několik zápisů.

source: Then, you can directly import the key into the Git database by exporting it and piping that through `git hash-object`, which writes a new blob with those contents into Git and gives you back the SHA-1 of the blob:
cs: Poté můžete klíč přímo importovat do databáze Git: vyexportujte ho a použijte příkaz `git hash-object`, který zapíše nový blob s tímto obsahem do systému Git a vrátí vám otisk SHA-1 tohoto blobu:

source: Then, you can fast-forward the base branch (`master`):
cs: Poté můžete bázovou větev (`master`) přesunout „rychle vpřed“:

source: Then, you can push to and pull from that remote as though you were doing so over a network.
cs: Poté můžete do vzdáleného repozitáře data odesílat (push) a stahovat je z něj (pull), jako byste tak činili prostřednictvím sítě.

source: Then, you can see what the `master` branch on the `origin` remote was the last time you communicated with the server, by checking the `refs/remotes/origin/master` file:
cs: Poté se můžete podívat, jakou podobu měla větev `master` na vzdáleném serveru `origin`, když jste s ním naposledy komunikovali. Pomůže vám s tím soubor `refs/remotes/origin/master`:

source: Then, you can send a request to the maintainer of the main project to pull in your changes.
cs: Poté můžete správci hlavního projektu odeslat žádost, aby do projektu vaše změny vtáhl (pull).

source: Then, you can use a branch name in any Git command that expects a commit object or SHA-1 value.
cs: V takovém případě můžete použít název větve v libovolném příkazu Git, který vyžaduje objekt revize nebo hodnotu SHA-1.

source: Then, you must tell bisect when the last known good state was, using `git bisect good [good_commit]`:
cs: Poté musíte nástroji bisect sdělit, kdy byl kód naposled nepochybně funkční. K tomu použijete příkaz `git bisect good [good_commit]`:

source: Then, you specify the mode, SHA-1, and filename:
cs: K tomu všemu přidáte režim, SHA-1 a název souboru:

source: Then, your editor will open to something like this for your placeholder commit message when you commit:
cs: Při zapisování revize váš editor otevře následující šablonu zprávy k revizi:

source: There are a couple of interesting things here.
cs: Výstup obsahuje řadu zajímavých informací.

source: There are a couple of minor differences in the configuration file; but for your purpose, this is close to the same thing.
cs: Bude tu sice pár menších rozdílů v konfiguračním souboru, ale pro náš účel můžeme příkazy považovat za ekvivalentní.

source: There are a few ways you can give access to everyone on your team.
cs: Existuje několik způsobů, jak umožnit přístup všem členům vašeho týmu.

source: There are a lot of client-side hooks.
cs: Na straně klienta existuje mnoho zásuvných modulů.

source: There are a lot of different ways to use Git.
cs: Git se dá používat mnoha různými způsoby.

source: There are a lot of great things about Git, but one feature that can cause issues is the fact that a `git clone` downloads the entire history of the project, including every version of every file.
cs: Systém Git nabízí velké množství úžasných funkcí a možností. Je však jedna věc, která vám může způsobovat problém. Je jí fakt, že příkaz `git clone` stáhne vždy celou historii projektu, všechny verze všech souborů.

source: There are also a few ways to install Git on Windows.(((Windows, installing))) The most official build is available for download on the Git website.
cs: I v systému Windows lze Git nainstalovat několika způsoby.(((Windows, instalace))) Hlavní oficiální instalátor se dá stáhnout z domovského webového serveru Gitu.

source: There are the original command line tools, and there are many graphical user interfaces of varying capabilities.
cs: K dispozici jsou původní nástroje pro použití z příkazového řádku a je tu i řada grafických uživatelských rozhraní s různými schopnostmi.

source: There are two columns to the output - the left hand column indicates that the file is staged and the right hand column indicates that it's modified.
cs: Značka na výstupu se zobrazuje ve dvou sloupcích. Levý sloupec indikuje stav souboru v oblasti připravených změn (index, stage area), v pravém sloupci se indikuje stav v pracovním stromu{empty}footnote:[Pozn. překl.: V době překladu byl originální popis zmatený. Upraveno podle dokumentace.].

source: There are two sets of processes for transferring data: a pair for uploading data and a pair for downloading data.
cs: Existují dvě sady procesů pro přenos dat: jeden pár pro upload dat a jeden pár pro jejich stahování.

source: There are ways to get around this (namely, stashing and commit amending) that we'll cover later on, in <<_git_stashing>>.
cs: Existují způsoby, jak to obejít (konkrétně odložení (stashing) a úprava revize (commit amending)), těm se však budeme věnovat až později, v části <<_git_stashing>>.

source: There is a bit of a problem – she needs to push the merged work in her `featureB` branch to the `featureBee` branch on the server.
cs: Tady nastává drobný problém. Musí odeslat sloučenou práce ze své větve `featureB` do větve `featureBee` na serveru.

source: There is another way to look at these diffs if you prefer a graphical or external diff viewing program instead.
cs: Pokud vám víc vyhovují grafické nebo jiné externí programy pro prohlížení změn, pak tu máme další možnost.

source: There is no difference in the end product of the integration, but rebasing makes for a cleaner history.
cs: Ve výsledcích integrace není žádný rozdíl, výsledkem přeskládání je však čistší historie.

source: There, you can do a mixed reset of that commit with `git reset HEAD^`, which effectively undoes that commit and leaves the modified files unstaged.
cs: Odtud můžete vytvořit smíšený reset této revize zadáním příkazu `git reset HEAD^`, který efektivně vrátí všechny změny v revizi a ponechá změněné soubory nepřipraveny k zapsání.

source: Therefore, the preferred method for collaborating with someone is to set up an intermediate repository that you both have access to, and push to and pull from that.
cs: Proto se pro spolupráci s ostatními doporučuje zřídit repozitář, ke kterému mají zúčastnění přístup pro odesílání (push) i pro stahování (pull).

source: These are generally automatically generated files such as log files or files produced by your build system.
cs: Jedná se většinou o automaticky vygenerované soubory, jako soubory log nebo soubory vytvořené při překladu.

source: These are some commonly used workflows that are possible with a distributed system like Git, but you can see that many variations are possible to suit your particular real-world workflow.
cs: Toto jsou tedy některé z běžně používaných pracovních postupů, které umožňují distribuované systémy, jako je Git. Ale sami vidíte, že lze uplatnit řadu variací, aby to vyhovovalo vašim konkrétně používaným pracovním postupům.

source: These are the core parts of Git.
cs: To jsou ústřední součásti adresáře Git.

source: These channels are regularly filled with hundreds of people who are all very knowledgeable about Git and are often willing to help.(((IRC)))
cs: Na těchto kanálech se většinou pohybují stovky lidí, kteří mají se systémem Git bohaté zkušenosti a často ochotně pomohou{empty}footnote:[Pozn. překl.: Nutno ovšem podotknout, že se na těchto kanálech komunikuje v angličtině.].(((IRC)))

source: These commands are nice because you can access them anywhere, even offline.
cs: Tyto příkazy jsou šikovné, neboť je můžete spustit kdykoli, dokonce i offline.

source: These days, you have a huge number of hosting options to choose from, each with different advantages and disadvantages.
cs: V dnešní době můžete vybírat z velkého počtu možností hostingu. Každá má jiné klady a zápory.

source: These examples use a very simple project called ``simplegit''.
cs: Následující příklady ukazují velmi jednoduchý projekt pojmenovaný `simplegit`.

source: These features help encourage developers to create and use branches often.
cs: Tyto vlastnosti pomáhají k tomu, aby se vývojáři nebáli větve často vytvářet a používat.

source: These files are pulled out of the compressed database in the Git directory and placed on disk for you to use or modify.
cs: Tyto soubory jsou vytaženy ze zkomprimované databáze v adresáři Git a umístěny na disk, kde je můžete používat nebo upravovat.

source: These filters can be set to do all sorts of fun things.
cs: Tyto filtry lze nastavit k různým šikovným úkonům.

source: These instructions tell you exactly what to do.
cs: Tyto instrukce vám sdělují, že nyní můžete upravit revizi příkazem git commit --amend, a až budete se změnami hotovi, spustit příkaz git rebase --continue.

source: These options apply to the `git rebase` command as well.
cs: A toto nastavení platí také pro příkaz `git rebase`.

source: These scripts run before and after pushes to the server.
cs: Tyto skripty se spouštějí před odesíláním revizí na server i po něm.

source: These systems (CVS, Subversion, Perforce, Bazaar, and so on) think of the information they keep as a set of files and the changes made to each file over time.
cs: Tyto systémy (CVS, Subversion, Perforce, Bazaar atd.) chápou uložené informace jako sadu souborů a změn každého z těchto souborů v čase.

source: These systems, such as CVS, Subversion, and Perforce, have a single server that contains all the versioned files, and a number of clients that check out files from that central place.
cs: Tyto systémy, jako je CVS, Subversion a Perforce, používají jeden server, který uchovává všechny verzované soubory, a více klientů, kteří umí soubory z centrálního místa získat.

source: These tools are very helpful if you modify a bunch of files and then decide that you want those changes to be in several focused commits rather than one big messy commit.
cs: Tyto nástroje se vám mohou velmi hodit, jestliže upravujete několik souborů a rozhodnete se, že tyto změny zapíšete raději do několika specializovaných revizí než do jedné velké nepřehledné.

source: These values are specific to that single repository.
cs: Tyto hodnoty platí pouze pro tento konkrétní repozitář.

source: They aren’t necessarily obvious but are helpful to know.
cs: Není nezbytně nutné, abyste je všechny znali, ale mohou být užitečné.

source: They can use that key to verify all your signed tags.
cs: Klíč pak může použít k ověření všech vašich podepsaných značek.

source: They have another parallel branch named `develop` or `next` that they work from or use to test stability – it isn't necessarily always stable, but whenever it gets to a stable state, it can be merged into `master`.
cs: Kromě toho mají další, paralelní větev `develop` nebo `next`, ve které pracují nebo ji používají pro testování stability. Tato větev nemusí být nutně stabilní, ale jakmile se dostane do stabilního stavu, může být začleněna do větve `master`.

source: They take the form `(remote)/(branch)`.
cs: Mají podobu `(vzdálený)/(větev)`.

source: They will stay as modified files on your disk.
cs: Zůstanou na vašem disku jako změněné soubory.

source: They're checksummed; contain the tagger name, email, and date; have a tagging message; and can be signed and verified with GNU Privacy Guard (GPG).
cs: U anotovaných značek se provádí kontrolní součet. Obsahují jméno autora značky (tagger), e-mail a datum, nesou vlastní zprávu značky (tagging message) a mohou být podepsány (signed) a ověřeny (verified) v programu GNU Privacy Guard (GPG).

source: They're local references that you can't move; they're moved automatically for you whenever you do any network communication.
cs: Jsou to lokální reference, které nemůžete posunovat. Posunují se automaticky v době, kdy probíhá komunikace po síti.

source: This Perl snippet strips out anything it sees in a `$Date$` string, to get back to where you started.
cs: Tento fragment Perl vyjme vše, co najde v řetězci `$Date$`, čímž se vrátí zpět do stavu, kde jste začali.

source: This allows you to set up several types of workflows that aren't possible in centralized systems, such as hierarchical models.
cs: Díky tomu lze zavést několik typů pracovních postupů, které nejsou v centralizovaných systémech možné -- jako jsou například hierarchické modely.

source: This also means that there is very little you can't do if you're offline or off VPN.
cs: To také znamená, že je jen velmi málo operací, které nemůžete provádět offline nebo bez připojení k VPN.

source: This also means the changes you make from this point forward will diverge from an older version of the project.
cs: To také znamená, že změny, které od tohoto okamžiku provedete, vedou k odklonu od starší verze projektu.

source: This also refers to the first parent, so `HEAD~` and `HEAD^` are equivalent.
cs: Také tento znak označuje prvního rodiče, výrazy `HEAD~` a `HEAD^` jsou proto ekvivalentní.
